# Notes:

You are banned from using loops (`for` or `while` or any other) for this entire workshop!

You shouldn't be using loops almost ever with pandas in any case, so break out of the habit now.

## 1. DataFrame basics


Consider the following Python dictionary `data` and Python list `labels`:

``` python
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
```
(This is just some meaningless data I made up with the theme of animals and trips to a vet.)

**1.** Create a DataFrame `df` from this dictionary `data` which has the index `labels`.

**2.** Select only the rows where visits are 3 or more. Which types of animals are these?

**3.** Select the rows where visists are 3 and the animal is a cat

**4.** Calculate the sum of all visits in `df` (i.e. the total number of visits).

**5.** Calculate the mean age for each different animal in `df`.

**6.** Append a new row 'k' to `df` with your choice of values for each column. Then delete that row to return the original DataFrame.

In [1]:
import pandas as pd
import numpy as np

data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(data, index=labels)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [2]:
df.nlargest(3, 'visits')

  animal  age  visits priority
b    cat  3.0       3      yes
d    dog  NaN       3      yes
f    cat  2.0       3       no

In [3]:
df_cat = df.loc[(df['animal'] == 'cat') & (df['visits'] > 2)]
print(df_cat)

  animal  age  visits priority
b    cat  3.0       3      yes
f    cat  2.0       3       no

In [4]:
visit = sum(df['visits'])
visit

19

In [ ]:
animal_mean_age = df.groupby(['animal'])[['age']].mean()
animal_mean_age

In [6]:
new_row_k = pd.Series({'animal': 'Python', 'age': 12, 'visits': 2, 'priority': 'no'}, name='k')
df = df.append(new_row_k, ignore_index=False)
df

   animal   age  visits priority
a     cat   2.5       1      yes
b     cat   3.0       3      yes
c   snake   0.5       2       no
d     dog   NaN       3      yes
e     dog   5.0       2       no
f     cat   2.0       3       no
g   snake   4.5       1       no
h     cat   NaN       1      yes
i     dog   7.0       2       no
j     dog   3.0       1       no
k  Python  12.0       2       no

In [7]:
df = df.drop('k')
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

# 2.1 Shifty problem

You have a DataFrame `df` with a column 'A' of integers. For example:
```python
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
```

How do you filter out rows which contain the same integer as the row immediately above?

You should be left with a column containing the following values:

```python
1, 2, 3, 4, 5, 6, 7
```

### Hint: use the `shift()` method

In [8]:
df2 = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
df2.drop_duplicates()

   A
0  1
1  2
3  3
4  4
5  5
8  6
9  7

# 2.2 columns sum min

Suppose you have DataFrame with 10 columns of real numbers, for example:

```python
df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))
```
Which column of numbers has the smallest sum? Return that column's label.

In [9]:
df3 = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))
df3_t = df3.sum(axis=0)
df3_t.nsmallest(1)

f    1.591963
dtype: float64

# 2.3 Duplicates

How do you count how many unique rows a DataFrame has (i.e. ignore all rows that are duplicates)?

**hint:** There's a method for to find duplicate rows for you

In [10]:
#You can use this function to get the unique rows

df3.drop_duplicates()

,a,b,c,d,e,f,g,h,i,j
0,0.130762,0.652625,0.272922,0.641777,0.135345,0.970562,0.817513,0.290026,0.621063,0.781023
1,0.382478,0.036518,0.884843,0.406481,0.257655,0.324387,0.687310,0.707921,0.564588,0.032695
2,0.837141,0.529455,0.900247,0.309141,0.915182,0.139460,0.411380,0.893454,0.308004,0.289213
3,0.924731,0.215894,0.400848,0.440759,0.214902,0.015719,0.028432,0.307639,0.208361,0.779698
4,0.922168,0.393546,0.629526,0.686218,0.548544,0.141834,0.969092,0.929970,0.463372,0.133897

# 2.4 Group Values

A DataFrame has a column of groups 'grps' and and column of integer values 'vals': 

```python
df = pd.DataFrame({'grps': list('aaabbcaabcccbbc'), 
                   'vals': [12,345,3,1,45,14,4,52,54,23,235,21,57,3,87]})
```
For each *group*, find the sum of the three greatest values.  You should end up with the answer as follows:
```
grps
a    409
b    156
c    345
```

In [11]:
df4 = pd.DataFrame({'grps': list('aaabbcaabcccbbc'), 
                   'vals': [12,345,3,1,45,14,4,52,54,23,235,21,57,3,87]})

df4.groupby('grps')['vals'].apply(lambda grp: grp.nlargest(3).sum())

grps
a    409
b    156
c    345
Name: vals, dtype: int64

# 3. Cleaning Data

### Making a DataFrame easier to work with

It happens all the time: someone gives you data containing malformed strings, Python, lists and missing data. How do you tidy it up so you can get on with the analysis?

Take this monstrosity as the DataFrame to use in the following puzzles:

```python
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})
```

Formatted, it looks like this:

```
            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"
```

**1.** Some values in the the **FlightNumber** column are missing (they are `NaN`). These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Modify `df` to fill in these missing numbers and make the column an integer column (instead of a float column).

In [12]:
df5 = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})
df5['FlightNumber'] = df5['FlightNumber'].fillna({1:10055, 3:10075})
df5['FlightNumber'].astype(int)

0    10045
1    10055
2    10065
3    10075
4    10085
Name: FlightNumber, dtype: int64

# 3.2 column splitting

The **From\_To** column would be better as two separate columns! Split each string on the underscore delimiter `_` to make two new columns `From` and `To` to your dataframe.

In [13]:
df5[['From','To']] = df5.From_To.str.split("_", expand=True)
df5

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045.0,"[23, 47]",KLM(!),LoNDon,paris
1,MAdrid_miLAN,10055.0,[],<Air France> (12),MAdrid,miLAN
2,londON_StockhOlm,10065.0,"[24, 43, 87]",(British Airways. ),londON,StockhOlm
3,Budapest_PaRis,10075.0,[13],12. Air France,Budapest,PaRis
4,Brussels_londOn,10085.0,"[67, 32]","""Swiss Air""",Brussels,londOn

# 3.3 Clean Text

Make the text in your dataframe:

- From and To columns should be lowercase with only first letter capitalized

- In the **Airline** column, you can see some extra puctuation and symbols have appeared around the airline names. Pull out just the airline name. E.g. `'(British Airways. )'` should become `'British Airways'`.

In [14]:
df5['From'] = df5['From'].astype(str)
df5['From'] = df5['From'].str.lower()
df5['From'] = df5['From'].str.capitalize()

df5['To'] = df5['To'].astype(str)
df5['To'] = df5['To'].str.lower()
df5['To'] = df5['To'].str.capitalize()
df5[['From', 'To']]

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

In [15]:
df5['Airline'] = df5['Airline'].str.replace('[^\w\s]','')
df5['Airline'] = df5['Airline'].str.replace('\d+', '')
df5['Airline']

0                 KLM
1         Air France
2    British Airways
3          Air France
4           Swiss Air
Name: Airline, dtype: object

# Exercise 4.1: Column Splitting

Given the unemployment data in `data/country_total.csv`, split the `month` column into two new columns: a `year` column and a `month` column, both integers

In [16]:
df6 = pd.read_csv('/Users/kalebmckenzie/Documents/GitHub/m2-1-pandas/data/country_total.csv')
df6['month'] = df6['month'].astype(str)
df6[['year','month']] = df6.month.str.split(".", expand=True)
df6[['year', 'month']].astype(int)

       year  month
0      1993      1
1      1993      2
2      1993      3
3      1993      4
4      1993      5
...     ...    ...
20791  2010      6
20792  2010      7
20793  2010      8
20794  2010      9
20795  2010      1

[20796 rows x 2 columns]

# 4.2 Group Statistics

Given the unemployment data in `data/country_sex_age.csv`, give the average unemployment rate for:

- Each gender
- Each Age Group
- Both Together

**HINT:** The `seasonality` column makes it such that the data is repeated for each method of calculating unemployment (`nsa`, `trend`, etc.). Can you ignore this and group over it? Or should you take the average for each?

In [17]:
df7 = pd.read_csv('/Users/kalebmckenzie/Documents/GitHub/m2-1-pandas/data/country_sex_age.csv')
gender_up = df7.groupby(['sex'])[['unemployment_rate']].mean()
gender_up

     unemployment_rate
sex
f            12.982629
m            11.671026

In [18]:

age_up = df7.groupby(['age_group'])[['unemployment_rate']].mean()
age_up

           unemployment_rate
age_group
y25-74              6.905394
y_lt25             17.774057

In [19]:
age_gender_up = df7.groupby(['sex','age_group'])
age_gender_up[['unemployment_rate']].mean()

               unemployment_rate
sex age_group
f   y25-74              7.566771
    y_lt25             18.457435
m   y25-74              6.244016
    y_lt25             17.098036

# 4.3 Estimating group size

Given that we have the unemployment **rate** as a % of total population, and the number of total unemployed, we can estimate the total population.

Give an estimate of the total population for men and women in each age group.

Does this change depending on the unemployment seasonality calculation method?

In [20]:
df6

      country seasonality month  unemployment  unemployment_rate  year
0          at         nsa    01        171000                4.5  1993
1          at         nsa    02        175000                4.6  1993
2          at         nsa    03        166000                4.4  1993
3          at         nsa    04        157000                4.1  1993
4          at         nsa    05        147000                3.9  1993
...       ...         ...   ...           ...                ...   ...
20791      uk       trend    06       2429000                7.7  2010
20792      uk       trend    07       2422000                7.7  2010
20793      uk       trend    08       2429000                7.7  2010
20794      uk       trend    09       2447000                7.8  2010
20795      uk       trend     1       2455000                7.8  2010

[20796 rows x 6 columns]

# 5.1 Tennis

In `data/tennis.csv` you have games that Roger Federer played against various opponents. Questions:

1. How many games did Federer win?

2. What is Federer's win/loss ratio?

3. Who were Federer's top 5 opponents?

In [7]:
dft = pd.read_csv('/Users/kalebmckenzie/Documents/GitHub/m2-1-pandas/data/tennis.csv')
dft['win'].sum()

972

In [22]:
wins = dft['win'].sum()
total_games = len(dft['win'])
losses = total_games - wins
win_loss_ratio = wins / losses
win_loss_ratio

4.695652173913044

In [23]:
list(dft.columns)
dft['winner'].value_counts().head(20)
#Top 5 opponents by wins on Federer
#Rafael Nadal              18
#Novak Djokovic            13
#Andy Murray               10
#David Nalbandian           8
#Lleyton Hewitt             8

Roger Federer            972
Rafael Nadal              18
Novak Djokovic            13
Andy Murray               10
Lleyton Hewitt             8
David Nalbandian           8
Tim Henman                 6
Tomas Berdych              5
Jiri Novak                 4
Nicolas Escude             4
Yevgeny Kafelnikov         4
Juan Martin Del Potro      4
Jo-Wilfried Tsonga         4
Tommy Haas                 3
Juan Carlos Ferrero        3
Guillermo Canas            3
Nicolas Kiefer             3
Patrick Rafter             3
Andre Agassi               3
Alex Corretja              3
Name: winner, dtype: int64

# 5.2 Over time

1. What was Federer's best year? In terms of money, and then in terms of number of wins

2. Did Federer get better or worse over time?

In [24]:
list(dft.columns)
money_year = dft.groupby(["year"])[['tournament prize money']].max()
print(money_year)
wins_year = dft.groupby(['year'])[['win']].sum()
print(wins_year)

#Rodger Federer has gotten better and stayed relatively consistant

     tournament prize money
year
1998                 $9,800
1999                 $9,929
2000                 $9,200
2001                $91,807
2002                 $9,940
2003               $956,802
2004               $915,960
2005               $820,000
2006                $98,600
2007                 $9,000
2008              A$342,500
2009                    NaN
2010            A$2,100,000
2011              A$420,000
2012                    NaN
       win
year
1998   2.0
1999  29.0
2000  36.0
2001  52.0
2002  63.0
2003  82.0
2004  77.0
2005  83.0
2006  96.0
2007  78.0
2008  76.0
2009  69.0
2010  76.0
2011  72.0
2012  81.0

# 5.3 Total money won

In the data, you'll find the `tournament round`, one value of which, `F` indicates the final.

Assuming Federer wins the money in the `tournament prize money` if he wins a final in a tournament, how much money has Federer made in tournaments in this dataset?

In [14]:
dft['tournament prize money'] = dft['tournament prize money'].str.replace('[^\w\s]','')
dft['tournament prize money'] = dft['tournament prize money'].str.replace('A', '')
dft['tournament prize money']= pd.to_numeric(dft['tournament prize money'], errors='coerce').fillna(0).astype(np.int64)
dft['tournament prize money']

# Wasnt able to figure out this column. Tried removing the punctuation, the type, everything.
# I tried .fillna to fill missing values with zero doesnt work.
# I cant properly answer the question if I cant turn this column into a int

AttributeError: Can only use .str accessor with string values!